TexasInstruments/mcu_plus_sdk_am261x/examples/drivers/boot/sbl_ospi_psram_xip/am261x-lp/r5fss0-0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM261x_ZFG" --part "AM2612" --package "ZFG" --context "r5fss0-0" --product "MCU_PLUS_SDK_AM261x@26.01.00"
 * @v2CliArgs --device "AM2612" --package "NFBGA (ZFG)" --variant "500MHz" --context "r5fss0-0" --product "MCU_PLUS_SDK_AM261x@26.01.00"
 * @versions {"tool":"1.27.0+4565"}
 */
scripting.excludeFromBuild("ti_clocktree_pll_config.c");

/**
 * Import the modules used in this configuration.
 */
const flash       = scripting.addModule("/board/flash/flash", {}, false);
const flash1      = flash.addInstance();
const ioexp       = scripting.addModule("/board/ioexp/ioexp", {}, false);
const ioexp1      = ioexp.addInstance();
const ram         = scripting.addModule("/board/ram/ram", {}, false);
const ram1        = ram.addInstance();
const bootloader  = scripting.addModule("/drivers/bootloader/bootloader", {}, false);
const bootloader1 = bootloader.addInstance();
const hsmclient   = scripting.addModule("/drivers/hsmclient/hsmclient", {}, false);
const hsmclient1  = hsmclient.addInstance();
const i2c         = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1        = i2c.addInstance();
const debug_log   = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg     = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7   = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71  = mpu_armv7.addInstance();
const mpu_armv72  = mpu_armv7.addInstance();
const mpu_armv73  = mpu_armv7.addInstance();
const mpu_armv74  = mpu_armv7.addInstance();
const mpu_armv75  = mpu_armv7.addInstance();
const mpu_armv76  = mpu_armv7.addInstance();
const general     = scripting.addModule("/memory_configurator/general", {}, false);
const general1    = general.addInstance();
const region      = scripting.addModule("/memory_configurator/region", {}, false);
const region1     = region.addInstance();
const section     = scripting.addModule("/memory_configurator/section", {}, false);
const section1    = section.addInstance();
const section2    = section.addInstance();
const section3    = section.addInstance();
const section4    = section.addInstance();
const section5    = section.addInstance();
const section6    = section.addInstance();
const section7    = section.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
ioexp1.$name = "CONFIG_IOEXP0";

ram1.$name                                                 = "CONFIG_RAM0";
ram1.serialRamDriver.$name                                 = "board_ram_serialRam_serialram0";
ram1.serialRamDriver.sramDummyClksRd                       = 9;
ram1.serialRamDriver.sramDummyClksWr                       = 4;
ram1.serialRamDriver.sramDummyClksCmd                      = 9;
ram1.serialRamDriver.peripheralDriver.$name                = "CONFIG_OSPI1";
ram1.serialRamDriver.peripheralDriver.protocol             = "8d_8d_8d";
ram1.serialRamDriver.peripheralDriver.phyEnable            = true;
ram1.serialRamDriver.peripheralDriver.rdDelayMin           = 0;
ram1.serialRamDriver.peripheralDriver.txDllLowWindowEnd    = 127;
ram1.serialRamDriver.peripheralDriver.txDllHighWindowStart = 0;
ram1.serialRamDriver.peripheralDriver.txDllHighWindowEnd   = 127;
ram1.serialRamDriver.peripheralDriver.rxLowSearchEnd       = 127;
ram1.serialRamDriver.peripheralDriver.rxHighSearchStart    = 0;
ram1.serialRamDriver.peripheralDriver.txLowSearchEnd       = 127;
ram1.serialRamDriver.peripheralDriver.txHighSearchStart    = 0;
ram1.serialRamDriver.peripheralDriver.txDLLSearchOffset    = 0;
ram1.serialRamDriver.peripheralDriver.rdDelayMax           = 4;
ram1.serialRamDriver.peripheralDriver.rxTxDLLSearchStep    = 2;
ram1.serialRamDriver.peripheralDriver.overrideInputClkFreq = true;
ram1.serialRamDriver.peripheralDriver.customInputClkFreq   = 133333333;
ram1.serialRamDriver.peripheralDriver.OSPI.CLK.$assign     = "GPIO29";
ram1.serialRamDriver.peripheralDriver.OSPI.CSn0.$assign    = "GPIO38";
ram1.serialRamDriver.peripheralDriver.OSPI.DQS.$assign     = "GPIO39";
ram1.serialRamDriver.peripheralDriver.OSPI.D7.$assign      = "GPIO37";
ram1.serialRamDriver.peripheralDriver.OSPI.D6.$assign      = "GPIO36";
ram1.serialRamDriver.peripheralDriver.OSPI.D5.$assign      = "GPIO35";
ram1.serialRamDriver.peripheralDriver.OSPI.D4.$assign      = "GPIO34";
ram1.serialRamDriver.peripheralDriver.OSPI.D3.$assign      = "GPIO33";
ram1.serialRamDriver.peripheralDriver.OSPI.D2.$assign      = "GPIO32";
ram1.serialRamDriver.peripheralDriver.OSPI.D1.$assign      = "GPIO31";
ram1.serialRamDriver.peripheralDriver.OSPI.D0.$assign      = "GPIO30";
ram1.serialRamDriver.peripheralDriver.child.$name          = "drivers_ospi_v0_ospi_v0_am261x_template1";
scripting.suppress("Overriding the input clock frequency is a risky operation\\. Ensure the custom frequency exactly matches the actual clock supplied to the OSPI peripheral\\. An incorrect value will misconfigure baud rate and timing parameters, potentially causing data corruption or flash communication failures\\.", ram1.serialRamDriver.peripheralDriver, "customInputClkFreq");

const gate58  = system.clockTree["PLL_ETH_HSDIV0_CLKOUT2_GATE"];
gate58.enable = true;

bootloader1.$name          = "CONFIG_BOOTLOADER0";
bootloader1.appImageOffset = "0x00081000";

flash1.$name                                    = "CONFIG_FLASH0";
bootloader1.flashDriver                         = flash1;
flash1.enableFlashReset                         = true;
flash1.peripheralDriver.$name                   = "CONFIG_OSPI0";
flash1.peripheralDriver.phyEnable               = true;
flash1.peripheralDriver.dmaEnable               = true;
flash1.peripheralDriver.overrideInputClkFreq    = true;
flash1.peripheralDriver.customInputClkFreq      = 133333333;
flash1.peripheralDriver.OSPI.CLK.$assign        = "GPIO10";
flash1.peripheralDriver.OSPI.CSn0.$assign       = "GPIO62";
flash1.peripheralDriver.OSPI.DQS.$assign        = "GPIO9";
flash1.peripheralDriver.OSPI.D7.$assign         = "GPIO68";
flash1.peripheralDriver.OSPI.D6.$assign         = "GPIO8";
flash1.peripheralDriver.OSPI.D5.$assign         = "GPIO67";
flash1.peripheralDriver.OSPI.D4.$assign         = "GPIO76";
flash1.peripheralDriver.OSPI.D3.$assign         = "GPIO69";
flash1.peripheralDriver.OSPI.D2.$assign         = "GPIO7";
flash1.peripheralDriver.OSPI.D1.$assign         = "GPIO70";
flash1.peripheralDriver.OSPI.D0.$assign         = "GPIO2";
flash1.peripheralDriver.OSPI.RESET_OUT0.$assign = "GPIO61";
flash1.peripheralDriver.child.$name             = "drivers_ospi_v0_ospi_v0_am261x_template0";
scripting.suppress("Overriding the input clock frequency is a risky operation\\. Ensure the custom frequency exactly matches the actual clock supplied to the OSPI peripheral\\. An incorrect value will misconfigure baud rate and timing parameters, potentially causing data corruption or flash communication failures\\.", flash1.peripheralDriver, "customInputClkFreq");

const edma                         = scripting.addModule("/drivers/edma/edma", {}, false);
const edma1                        = edma.addInstance({}, false);
edma1.$name                        = "CONFIG_EDMA0";
flash1.peripheralDriver.edmaDriver = edma1;
edma1.edmaRmDmaCh[0].$name         = "CONFIG_EDMA_RM0";
edma1.edmaRmQdmaCh[0].$name        = "CONFIG_EDMA_RM1";
edma1.edmaRmTcc[0].$name           = "CONFIG_EDMA_RM2";
edma1.edmaRmParam[0].$name         = "CONFIG_EDMA_RM3";

hsmclient1.$name = "CONFIG_HSMCLIENT0";

i2c1.$name              = "CONFIG_I2C0";
ioexp1.peripheralDriver = i2c1;
i2c1.I2C.$assign        = "I2C0";
i2c1.I2C_child.$name    = "drivers_i2c_v1_i2c_v1_template0";

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.intrEnable       = "DISABLE";
debug_log.uartLog.UART.RXD.$assign = "GPIO27";
debug_log.uartLog.UART.TXD.$assign = "GPIO28";
debug_log.uartLog.child.$name      = "drivers_uart_v2_uart_v2_template0";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x80000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;
mpu_armv74.attributes        = "Cached+Sharable";

mpu_armv75.$name        = "CONFIG_MPU_REGION4";
mpu_armv75.allowExecute = false;
mpu_armv75.attributes   = "Device";
mpu_armv75.baseAddr     = 0xCE000000;
mpu_armv75.size         = 24;

mpu_armv76.$name      = "CONFIG_MPU_REGION5";
mpu_armv76.size       = 27;
mpu_armv76.attributes = "Device";
mpu_armv76.baseAddr   = 0xA0000000;

general1.$name          = "CONFIG_GENERAL0";
general1.irq_stack_size = 4096;
general1.linker.$name   = "TIARMCLANG0";

region1.$name                               = "MEMORY_REGION_CONFIGURATION";
region1.memory_region.create(8);
region1.memory_region[0].type               = "TCMA";
region1.memory_region[0].$name              = "R5F_VECS";
region1.memory_region[0].auto               = false;
region1.memory_region[0].size               = 0x100;
region1.memory_region[1].type               = "TCMA";
region1.memory_region[1].$name              = "R5F_TCMA";
region1.memory_region[1].auto               = false;
region1.memory_region[1].manualStartAddress = 0x100;
region1.memory_region[1].size               = 0x7F00;
region1.memory_region[2].type               = "TCMB";
region1.memory_region[2].size               = 0x8000;
region1.memory_region[2].$name              = "R5F_TCMB0";
region1.memory_region[2].manualStartAddress = 0x41010000;
region1.memory_region[3].$name              = "MSRAM_VECS";
region1.memory_region[3].auto               = false;
region1.memory_region[3].manualStartAddress = 0x70002000;
region1.memory_region[3].size               = 0x100;
region1.memory_region[4].$name              = "MSRAM_0";
region1.memory_region[4].manualStartAddress = 0x70002100;
region1.memory_region[4].size               = 0x50000;
region1.memory_region[4].auto               = false;
region1.memory_region[5].$name              = "MSRAM_HSMRT";
region1.memory_region[5].size               = 0x30000;
region1.memory_region[5].auto               = false;
region1.memory_region[5].manualStartAddress = 0x70052100;
region1.memory_region[6].type               = "CUSTOM";
region1.memory_region[6].$name              = "MAILBOX_HSM";
region1.memory_region[6].auto               = false;
region1.memory_region[6].manualStartAddress = 0x44000000;
region1.memory_region[6].size               = 0x3CE;
region1.memory_region[7].type               = "CUSTOM";
region1.memory_region[7].size               = 0x3CE;
region1.memory_region[7].$name              = "MAILBOX_R5F";
region1.memory_region[7].auto               = false;
region1.memory_region[7].manualStartAddress = 0x44000400;

section1.load_memory                              = "MSRAM_VECS";
section1.group                                    = false;
section1.run_memory                               = "R5F_VECS";
section1.$name                                    = "Sbl Initialization Code";
section1.output_section.create(1);
section1.output_section[0].$name                  = ".sbl_init_code";
section1.output_section[0].input_section.create(1);
section1.output_section[0].input_section[0].$name = "*(.vectors). = align(8);";

section2.load_memory                  = "MSRAM_0";
section2.$name                        = "Text Segments";
section2.output_section.create(7);
section2.output_section[0].$name      = ".text";
section2.output_section[0].palignment = true;
section2.output_section[1].$name      = ".text.hwi";
section2.output_section[1].palignment = true;
section2.output_section[2].$name      = ".text.cache";
section2.output_section[2].palignment = true;
section2.output_section[3].$name      = ".text.mpu";
section2.output_section[3].palignment = true;
section2.output_section[4].$name      = ".text.boot";
section2.output_section[4].palignment = true;
section2.output_section[5].$name      = ".data";
section2.output_section[5].palignment = true;
section2.output_section[6].$name      = ".rodata";
section2.output_section[6].palignment = true;

section3.load_memory                             = "MSRAM_0";
section3.group                                   = false;
section3.$name                                   = "Memory Segments";
section3.output_section.create(3);
section3.output_section[0].$name                 = ".bss";
section3.output_section[0].output_sections_start = "__BSS_START";
section3.output_section[0].output_sections_end   = "__BSS_END";
section3.output_section[0].palignment            = true;
section3.output_section[1].$name                 = ".sysmem";
section3.output_section[1].palignment            = true;
section3.output_section[2].$name                 = ".stack";
section3.output_section[2].palignment            = true;

section4.$name                                    = "Stack Segments";
section4.load_memory                              = "MSRAM_0";
section4.output_section.create(5);
section4.output_section[0].$name                  = ".irqstack";
section4.output_section[0].output_sections_start  = "__IRQ_STACK_START";
section4.output_section[0].output_sections_end    = "__IRQ_STACK_END";
section4.output_section[0].input_section.create(1);
section4.output_section[0].input_section[0].$name = ". = . + __IRQ_STACK_SIZE;";
section4.output_section[1].$name                  = ".fiqstack";
section4.output_section[1].output_sections_start  = "__FIQ_STACK_START";
section4.output_section[1].output_sections_end    = "__FIQ_STACK_END";
section4.output_section[1].input_section.create(1);
section4.output_section[1].input_section[0].$name = ". = . + __FIQ_STACK_SIZE;";
section4.output_section[2].$name                  = ".svcstack";
section4.output_section[2].output_sections_start  = "__SVC_STACK_START";
section4.output_section[2].output_sections_end    = "__SVC_STACK_END";
section4.output_section[2].input_section.create(1);
section4.output_section[2].input_section[0].$name = ". = . + __SVC_STACK_SIZE;";
section4.output_section[3].$name                  = ".abortstack";
section4.output_section[3].output_sections_start  = "__ABORT_STACK_START";
section4.output_section[3].output_sections_end    = "__ABORT_STACK_END";
section4.output_section[3].input_section.create(1);
section4.output_section[3].input_section[0].$name = ". = . + __ABORT_STACK_SIZE;";
section4.output_section[4].$name                  = ".undefinedstack";
section4.output_section[4].output_sections_start  = "__UNDEFINED_STACK_START";
section4.output_section[4].output_sections_end    = "__UNDEFINED_STACK_END";
section4.output_section[4].input_section.create(1);
section4.output_section[4].input_section[0].$name = ". = . + __UNDEFINED_STACK_SIZE;";

section5.load_memory             = "MSRAM_HSMRT";
section5.group                   = false;
section5.$name                   = "Hsmrt";
section5.output_section.create(1);
section5.output_section[0].$name = ".rodata.hsmrt";

section6.load_memory                 = "MAILBOX_HSM";
section6.type                        = "NOLOAD";
section6.group                       = false;
section6.$name                       = "SIPC HSM Queue Memory";
section6.output_section.create(1);
section6.output_section[0].$name     = ".bss.sipc_hsm_queue_mem";
section6.output_section[0].alignment = 0;

section7.load_memory                 = "MAILBOX_R5F";
section7.type                        = "NOLOAD";
section7.group                       = false;
section7.$name                       = "SIPC R5F Queue Memory";
section7.output_section.create(1);
section7.output_section[0].$name     = ".bss.sipc_secure_host_queue_mem";
section7.output_section[0].alignment = 0;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
ram1.serialRamDriver.peripheralDriver.OSPI.$suggestSolution            = "OSPI1";
ram1.serialRamDriver.peripheralDriver.OSPI.RESET_OUT0.$suggestSolution = "GPIO20";
flash1.peripheralDriver.OSPI.$suggestSolution                          = "OSPI0";
i2c1.I2C.SCL.$suggestSolution                                          = "GPIO135";
i2c1.I2C.SDA.$suggestSolution                                          = "GPIO134";
debug_log.uartLog.UART.$suggestSolution                                = "UART0";
